/* Функции Значимости элементов восприятия 

Значимость всегда определяется в контексте всех предшествующих условий,
т.е. специфична для активностей деревьев автоматизмов и понимания.

При каждом вызове consciousness определяется текущий объект наибольшой значимости в воспринимаемом -
в функции определения текущей Цели getMentalPurpose().
*/

package psychic


/////////////////////////////////////////////////
/*Значимость - величина от 0 до 10, приобретаемая объектов внимания в данной ситуации
- берется из результата пробных действий и связывается ос всеми компонентами воспринимаемого в этих условиях
Тот объект, применение которого привело к данной значимости.
Вызывается в момент ответных действий оператора в период ожидания.
Используется curActiveActions - как ответ типа ActionsImage в период ожидания и получение эффекта effect
*/
func setImportance(effect int){



}
////////////////////////////////////////////////

/*ри каждом вызове consciousness определяется текущий объект наибольшой значимости в воспринимаемом -
в функции определения текущей Цели getMentalPurpose()
*/
func getGreatestImportance(){

}
/////////////////////////////////////////////////









