/* Ориентировочный рефлекс осознания ситуации.

В любом случае orientationConsciousness(kind int) - осмысление ситуации SituationImage:
Тип ситуации:
	0 - ничего не делали, но нужно осмысление
	1 - было действие автоматизма (смотреть в автоматизме ветки Usefulness int - (БЕС)ПОЛЕЗНОСТЬ: вред: -10 0 +10 +n польза diffPsyBaseMood )
	2 - был автоматический запуск автоматизма без ориентировочного рефлекса.
	3 - был плохой автоматизм, нужно найти лучше
	4 - все спокойно, можно экспериментивароть
	5 - есть важные (по опыту) признаки в новизне NoveltySituation - осмыслить их

Попытка подставить вместо текущего автоматизма более правильный в новых условиях - ор.рефлекс в дереве
Оценка результата автоматизма и корректировка мозжечковыми рефлексами
ПРИ ОСОЗНАНИИ ЦЕЛИ И ПЕРЕБОРА_НЕДОБРА, А ТАК ЖЕ НЕОБХОДИМОСТИ ДОПОЛНИТЕЛЬНЫХ (корректирующих)ДЕЙСТВИЙ.
*/

package psychic

///////////////////////////////////////



/* kind:
0 - вообще еще нет ветки с нуля - полная новизна условий
1 - частино есть ветка - частичная новизна условий
2 - ветка полностью есть, только новизна ситуации


// нераспознанный остаток - НОВИЗНА: var CurrentUnderstandingTreeEnd []int
*/
func orientationConsciousness(kind int){


}
////////////////////////////////////


/*
 */