/* Процессы осмысления: создание и использование ментальных автоматизмов
для Дерева понимания (или дерева ментальных автоматизмов)

*/

package psychic

///////////////////////////////


//////////////////////////////////////////////////
/* Определение Цели в данной ситуации - на уровне дерева понимания
	Здесь выбирается действие пробного автоматизма из выполнившегося рефлекса actualRelextActon
	и запускается МЕНТАЛЬНЫЙ автоматизм.
	На стадии 4 - провоцировать оператора на ответы (почему, зачем, что такое?)
*/
func getPurposeUndestandingAndRunAutomatizm()(bool) {


	// мозжечковые рефлексы - самый первый уровень осознания - подгонка действий под заданную Цель.
	if EvolushnStage == 4 {
		/*  на стадии 4 - провоцировать оператора на ответы (почему, зачем, что такое?)


		 */
	}
/*
	// переосмыслить ситуацию - Активировать Дерево Понимания
	//understandingSituation()
	и затем создать новую цель understanding_purpose_image.go
*/


	return false
}
////////////////////////////////////////////////



